name: "bge_model"
backend: "onnxruntime"
max_batch_size: 32

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [512]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [512]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [1024]
  }
]

dynamic_batching {
    max_queue_delay_microseconds: 5000
}

instance_group [
  {
    count: 3
    kind: KIND_GPU
    gpus: [0]
  },
  {
    count: 3
    kind: KIND_GPU
    gpus: [1]
  }
]
